<template>
  <div>
    <v-sheet max-width="800" min-width="300" class="mx-auto pa-5">
      <h2>プライバシーポリシー</h2>
      <p>
        本プライバシーポリシーは、「GreenPark」(https://greenpark.icu/)(以下、「当サイト」とします)の各種サービスにおいて、
        当サイトの訪問者(以下、「訪問者」とします)の個人情報を取り扱う際に当サイトが遵守する方針です。
      </p>
      <h3>個人情報の取得と利用</h3>
      <ol>
        <li>
          当サイトでは、メールでのお問い合わせの際に、名前(ハンドルネーム)、メールアドレス等の個人情報をご登録いただく場合がございます。
        </li>
        <li>
          これらの個人情報は質問に対する回答や必要な情報を電子メール等でご連絡する場合に利用させていただくものでそれらの目的以外では利用いたしません。
        </li>
        <li>Google Analyticsについて</li>
        <ol>
          <li>
            利用状況を把握するためGoogleが提供している分析ツール「GoogleAnalytics」を利用しています。
            (Google&nbsp;Analyticsのプライバシーとセキュリティについてはコチラを参照してください)
          </li>
          <li>
            このGoogle&nbsp;Analyticsはトラフィックデータの収集のためにCookieを使用しています。
          </li>
          <li>
            このトラフィックデータは匿名で収集されており、個人を特定するものではありません。
          </li>
          <li>
            この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。
          </li>
        </ol>
      </ol>
      <h3>個人情報の保管</h3>
      <p>
        取得した個人情報について不正アクセス・紛失・破損・改ざん・漏洩などを防止するため、
        セキュリティシステムの維持等の必要な措置を講じ、安全対策を実施し個人情報の厳重な管理を行ないます。
      </p>
      <h3>個人情報の開示</h3>
      <p>
        次に該当する場合を除いて、取得した個人情報を第三者に開示することはありません。
      </p>
      <ol>
        <li>提供者の同意がある場合</li>
        <li>法令等に基づき開示が必要となる場合</li>
      </ol>
      <p>
        提供者ご本人の個人情報の照会・修正・削除などをご希望される場合には、ご本人であることを確認の上、対応させていただきます。
      </p>
      <h3>免責事項</h3>
      <ol>
        <li>
          当サイトで掲載している画像の著作権・肖像権等は各権利所有者に帰属致します。権利を侵害する目的ではございません。
        </li>
        <li>
          記事の内容や掲載画像等に問題がございましたら、各権利所有者様ご本人が直接お問い合わせください。確認後、対応させて頂きます。
        </li>
        <li>
          当サイトからリンクやバナーなどによって他のサイトに移動された場合、移動先サイトで提供される情報、サービス等について一切の責任を負いません。
        </li>
        <li>
          当サイトのコンテンツ・情報につきまして、可能な限り正確な情報を掲載するよう努めておりますが、誤情報が入り込んだり、情報が古くなっていることもございます。
        </li>
        <li>
          当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。
        </li>
      </ol>
      <h3>著作権について</h3>
      <ol>
        <li>
          当サイトに掲載されている情報についての著作権は放棄しておりません。
        </li>
        <li>
          当サイトに存在する、文章・画像・動画等の著作物の情報を無断転載を禁止いたします。
        </li>
      </ol>
      <h3>プライバシーポリシーの変更について</h3>
      <ol>
        <li>
          当サイトは、個人情報に関して適用される日本の法令を遵守するとともに、本ポリシーの内容を適宜見直しその改善に努めます。
        </li>
        <li>
          修正された最新のプライバシーポリシーは常に本ページにて開示されます。
        </li>
      </ol>
      <h3>お問い合わせ</h3>
      <p>
        当サイトの個人情報の取扱に関するお問い合せは&nbsp;<RouterLink
          :to="{ name: 'Contact' }"
          >コチラ</RouterLink
        >&nbsp;からご連絡ください。
      </p>
      <p class="text-end">以上</p>
    </v-sheet>
  </div>
</template>

<script setup></script>

<style lang="scss" scoped>
h3 {
  padding: 0.5rem;
  border-left: 10px solid #51ac9a;
  background-color: #efefef;
}

p {
  padding: 1rem 0 1rem 1rem;
}

ol {
  padding: 1rem 0 1rem 2rem;
}

li {
  margin-left: 0.5rem;
  padding: 0.3rem;
}
li::marker {
  font-weight: bold;
  color: #51ac9a;
}
</style>
